Update README.md to production grade
